Documents/А_РаспределениеЗаработнойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_РаспределениеЗаработнойПлаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ДвиженияДенегДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиратьТабельПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределятьНаправлениеПоТабелю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСотрудникаКазна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СотрудникиИсключения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>А_ДвижениеДДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/А_РаспределениеЗаработнойПлаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	Если Элементы.Сотрудники.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Элементы.Сотрудники.ТекущиеДанные <> Неопределено Тогда
		Элементы.Распределение.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", Элементы.Сотрудники.ТекущиеДанные.Сотрудник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	Если Элементы.Сотрудники.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Элементы.Сотрудники.ТекущиеДанные <> Неопределено Тогда
		Элементы.Распределение.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", Элементы.Сотрудники.ТекущиеДанные.Сотрудник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПередНачаломИзменения(Элемент, Отказ)
	// Обработчик события
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Элементы.Сотрудники.ТекущиеДанные <> Неопределено Тогда
			Элементы.Распределение.ТекущиеДанные.Сотрудник = Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// TODO: Требуется настройка COM-подключения к базе ЗУП
// Эта процедура получает данные о начислениях из внешней базы ЗУП через COM-соединение
// Для работы необходимо настроить параметры подключения
&НаСервере
Процедура ПолучитьДанныеИзБухгалтерииНаСервере()

	// === ВНИМАНИЕ: COM-подключение к ЗУП закомментировано ===
	// Для активации раскомментируйте код ниже и настройте параметры подключения

	Сообщить("Функция получения данных из ЗУП требует настройки COM-подключения.");
	Сообщить("Добавьте сотрудников вручную или настройте подключение к базе ЗУП.");

	// -------------------------------------------------------------------------
	// ОРИГИНАЛЬНЫЙ КОД COM-ПОДКЛЮЧЕНИЯ (закомментирован):
	// -------------------------------------------------------------------------
	//
	// V8 = Новый COMОбъект("V83.COMConnector");
	// СтрПодключения = "srvr=""localhost"";ref=""zup"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";
	//
	// Попытка
	//     БазаПР = V8.Connect(СтрПодключения);
	// Исключение
	//     Сообщить(ОписаниеОшибки());
	//     Сообщить("Ошибка при подключении!");
	//     Возврат;
	// КонецПопытки;
	//
	// ... далее запросы к базе ЗУП ...
	//
	// -------------------------------------------------------------------------

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзБухгалтерии(Команда)
	ПолучитьДанныеИзБухгалтерииНаСервере();
КонецПроцедуры

// Распределение зарплаты по подразделениям
// TODO: Требуется регистр накопления ДанныеТабелирования для полноценной работы
&НаСервере
Процедура РаспределитьНаСервере()

	// Упрощенный вариант распределения без регистра ДанныеТабелирования
	// Распределяем всю сумму на основное подразделение сотрудника

	Объект.Распределение.Очистить();

	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл

		Если Не ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Объект.Распределение.Добавить();
		НоваяСтрока.Сотрудник = СтрокаСотрудник.Сотрудник;
		НоваяСтрока.СуммаНачисления = СтрокаСотрудник.СуммаНачисления;
		НоваяСтрока.СуммаФОТ = СтрокаСотрудник.СуммаФОТ;
		НоваяСтрока.СуммаНалогов = СтрокаСотрудник.СуммаНалогов;

		// Подразделение берем из карточки сотрудника
		Если ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник.ОсновноеПодразделение) Тогда
			НоваяСтрока.Подразделение = СтрокаСотрудник.Сотрудник.ОсновноеПодразделение;
		ИначеЕсли ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник.Родитель)
			И ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник.Родитель.ОсновноеПодразделение) Тогда
			НоваяСтрока.Подразделение = СтрокаСотрудник.Сотрудник.Родитель.ОсновноеПодразделение;
		КонецЕсли;

		// Направление берем из карточки сотрудника
		Если ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник.ОсновноеНаправление) Тогда
			НоваяСтрока.Направление = СтрокаСотрудник.Сотрудник.ОсновноеНаправление;
		КонецЕсли;

		// Часы не заполняем - требуется регистр ДанныеТабелирования
		НоваяСтрока.ОтработаноЧасов = 0;

	КонецЦикла;

	Если Объект.Распределение.Количество() = 0 Тогда
		Сообщить("Нет данных для распределения. Добавьте сотрудников в таблицу.");
	Иначе
		Сообщить("Распределено по " + Объект.Распределение.Количество() + " записям (упрощенный режим без табеля).");
	КонецЕсли;

	// -------------------------------------------------------------------------
	// ОРИГИНАЛЬНЫЙ КОД С ЗАПРОСОМ К РЕГИСТРУ ДанныеТабелирования (закомментирован):
	// -------------------------------------------------------------------------
	// Для полноценной работы необходимо добавить регистр накопления ДанныеТабелирования
	// с измерениями: Сотрудник, Подразделение, Состояние, Организация, Направление
	// и ресурсами: ЧасыФакт, ЧасыПлан
	// -------------------------------------------------------------------------

КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Проверка дат запрета изменения (БСП)
	// Закомментировано для совместимости - раскомментируйте если БСП настроена
	// ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры
